app/models/job.rb

  def record_download!(current_user = nil, session_id = nil, ip_address = nil)
    download = downloads.create!(
      user: current_user,
      ip_address: ip_address,
      session_id: session_id,
      downloaded_at: Time.current
    )
---
INSERT INTO "downloads" ("user_id", "job_id", "ip_address", "session_id", "downloaded_at", "created_at", "updated_at") VALUES (1, 22, '127.0.0.1', 'test_session_123', '2025-09-28 08:52:50.423853', '2025-09-28 08:52:50.430074', '2025-09-28 08:52:50.430074') RETURNING "id"